<template>
    <div class="prot-wrap">
        <article>本服务协议（以下简称“本协议”）是杭州迪火科技有限公司（以下简称“二维火”）与二维火用户（以下简称“用户”或“您”）就“刷脸”服务的开通、使用等相关事项所订立的有效合约。您通过点击“同意”或以其他方式选择接受本协议，即表示您与二维火已达成协议并同意接受本协议的约定内容。如果您不同意本协议或其中任何条款约定，您应立即停止注册程序。</article>
        <article>在接受本协议之前，为维护您自身权益，请您仔细阅读本协议的全部内容及各条款具体表述，尤其是如下条款:<br>1.与您约定免除或限制二维火责任的条款；<br>2.与您约定法律适用和管辖约定条款；<br>3.其他以粗体加黑标示的重要条款。<br>如您对本协议有任何疑问，可拨打客服电话<a href="tel:4000-166-588"><u>4000-166-588</u></a>进行咨询。</article>
        <article>
            <h2>一、定义</h2>
            1.1刷脸设置:二维火通过人脸采集和对比，结合您的身份信息和操作环境信息，确认您本人身份，并向您提供刷脸取餐和就餐的服务。<br><br>
            1.2扫脸取餐:通过采集和验证人脸信息后，您可以通过刷脸的方式到支持该业务的门店领取已预订的餐品。<br><br>
            1.3人脸会员:通过采集和验证人脸信息后，您可以通过刷脸的方式到支持该业务的门店享受会员权益。<br><br>
            1.4平台规则：包括在所有二维火平台公众号、客户端、网站等已经发布及后续发布的全部规则、解读、公告等内容以及各平台在频道、活动页面、帮助中心等发布的各类规则、实施细则、产品说明、公告等。<br><br>
            <h2>二、双方权利义务</h2>
            2.1您同意开通并使用二维火的人脸会员服务。为了方便您在不同商户处使用人脸会员和扫脸取餐服务并提升刷脸服务的准确性和安全性，您同意并授权二维火采集并保存您的人脸信息和设备信息；同时，您可以在二维火吃喝购公众号里的会员中心模块或者商家的扫码点餐流程入口进行刷脸设置。<br><br>
            2.2使用刷脸取餐时，您同意仅使用您本人的脸部信息为您本人实现使用刷脸取餐服务。<br><br>
            2.3您理解并同意，一旦您使用刷脸取餐或者刷脸会员功能扫描脸部并通过之后，即视为您向二维火发出了对指定商户的验证指令，具体刷脸服务以具体场景为准。<br><br>
            2.4为了确认您是否为接受人脸会员服务的会员、是否可享受会员福利和权益，二维火可能会将门店实时采集到的您的人脸信息与二维火平台事先留存的您的人脸信息以及您跟服务商家之间的会员关系进行比对，并把比对结果告知商户。会员福利和权益以具体商户为准。<br><br>
            2.5您同意不将本人的人脸信息用于他人二维火账户的刷脸支付，或采取不正当或欺骗手段使用他人二维火账户，否则您应当承担相应的法律责任，且二维火有权停止为您提供服务，并依法采取相应的法律措施。<br><br>
            2.6二维火重视对您的信息保护，严格保护您的身份资料和脸部信息，二维火将依照法律法规及其他与您的约定保护您的信息。<br><br>
            2.7除本协议另有约定外，基于业务调整需要，二维火提前通过推送通知、手机短信、电子邮件、微信、函件或在二维火网站公告（包括但不限于站内消息、弹出消息、客户端推送的消息等）等其他的方式予以通知，可以停止向您提供刷脸服务。<br><br>
            <h2>三、协议变更</h2>
            3.1双方经协商一致，可以变更本协议。为了进一步改善用户体验，二维火将会持续开发新服务，为用户提供版本升级、功能升级等服务和内容更新，这些更新将会同步体现在协议条款当中。如您选择继续使用二维火刷脸服务，则表示您同意更新后的协议条款。如果更新的内容涉及您的主要权利或责任，二维火会向您进行提示，您也可以随时在二维火平台公众号内的会员中心的刷脸设置中查阅最新版本的协议条款。<br><br>
            3.2在法律有明确规定要求二维火对部分用户的信息进行核实的情况下，二维火将依法不时地对您的信息进行检查核实，您应当配合提供最新、真实、完整的信息。<br><br>
            3.3二维火可根据国家法律法规变化及二维火人脸会员服务变化的需要，不时修改本协议、补充协议，变更后的协议、补充协议（下称“变更事项”）将通过本协议第二条第2.7款约定的方式通知您。<br><br>
            3.4如您对变更事项不同意的，您应当于变更事项确定的生效之日起停止使用二维火人脸会员服务；如您在变更事项生效后仍继续使用二维火人脸会员服务，则视为您同意已生效的变更事项。<br><br>
            <h2>四、责任限制</h2>
            4.1请您理解，由于技术水平限制及可能存在的各种恶意手段，有可能因二维火可控范围外的因素而出现问题。由于不可抗力、计算机黑客袭击、系统故障、通讯故障、供电系统故障、电脑病毒、恶意程序攻击及其他不可归因于二维火的情况而导致用户损失的，二维火不承担责任；但如因二维火故意或重大过失导致您的信息泄露并给您造成直接损失的，二维火应依法承担赔偿责任。若不幸发生个人信息安全事件，二维火将按照法律法规的要求，及时向您告知安全事件的基本情况和可能的影响、二维火已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。二维火将及时将事件相关情况以邮件、信函、电话、推送通知方式或发布公告的方式告知您。<br><br>
            4.2二维火应在现有技术能力基础上保障刷脸服务的有效、正常运行，并尽商业上合理的努力来提升刷脸验证结果的准确性。但是，由于采集面部信息易受表情、妆容、环境光等可变因素影响，且二维火能采集到的信息范围有限、技术水平及认证手段也仍在持续改进之中，二维火暂无法保证认证结果的绝对准确。后期产品优化后可支持重新提交，到时您可重新提交人脸信息，或通过客服电话反馈，以便二维火重新验证并进一步提升验证水平。<br><br>
            4.3二维火提醒您，二维火按本协议约定仅向您提供刷脸服务。商户将独立向您提供具体商品与服务，二维火无法对商户向您提供的商品或服务作出承诺或承担担保责任。您与商户之间就具体商品或服务的争议和纠纷，请您自行与商户协商解决。<br><br>
            4.4您确认，在您开始使用二维火的人脸会员服务前，您应当具备中华人民共和国法律规定的与您行为相适应的民事行为能。若您不具备前述与您行为相适应的民事行为能力，则您及您的监护人应依照法律规定承担因此而导致的一切后果。<br><br>
            4.5特别地，如果您是未成年人，请在您的监护人的同意和指导下访问和/或使用二维火人脸会员服务。<br><br>
            4.6您理解并承诺，您的身份和操作环境等信息不得出现违法和不良信息，没有冒用、关联机构或社会名人，您在使用二维火人脸会员服务过程中需遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线。<br><br>
            <h2>八、违约及处理</h2>
            8.1违约认定，发生如下情形之一的，视为您违约：<br>
            8.1.1使用二维火人脸会员服务时违反有关法律法规规定的；<br>
            8.1.2违反本协议约定的。<br><br>
            8.2为适应互联网行业发展和满足海量用户对高效优质服务的需求，您理解并同意，二维火可在二维火平台规则中约定违约认定的程序和标准。如：二维火可依据您的用户数据与海量用户数据的关系来认定您是否构成违约；您有义务对您的数据异常现象进行充分举证和合理解释，否则将被认定为违约。<br><br>
            8.3违约处理措施：<br>
            8.3.1您在使用二维火人脸会员服务构成违约的，二维火可根据相应规则立即对您进行暂停使用、查封、注销等处理。<br>
            8.3.2如果您在使用二维火人脸会员服务的行为违反相关的法律法规，二维火可依法向相关主管机关报告并提交您的使用记录和其他信息。<br><br>
            8.4赔偿责任：<br>
            8.4.1如您的行为使二维火及/或其关联公司遭受损失（包括自身的直接经济损失、商誉损失及对外支付的赔偿金、和解款、律师费、诉讼费等间接经济损失），您应赔偿二维火及/或其关联公司的上述全部损失。<br>
            8.4.2如您的行为使二维火及/或其关联公司遭受第三人主张权利，二维火及/或其关联公司可在对第三人承担金钱给付等义务后就全部损失向您追偿。<br><br>
            <h2>九、特别约定</h2>
            9.1二维火负责"按现状"和"可得到"的状态向您提供二维火人脸会员服务。二维火依法律规定承担相应义务，但无法对由于信息网络设备维护、连接故障，电脑、通讯或其他系统的故障，黑客活动、计算机病毒、电力故障，罢工，暴乱，火灾，洪水，风暴，爆炸，战争，政府行为，司法行政机关的命令或因第三方原因而给您造成的损害结果承担责任。<br><br>
            9.2二维火通过中华人民共和国境内的设施控制和提供二维火人脸会员服务，二维火不担保控制或提供的服务在其他国家或地区是适当的、可行的，任何在其他司法辖区使用二维火人脸会员服务的用户应自行确保其遵守当地的法律法规，二维火对此不承担任何责任。<br><br>
            <h2>十、协议的终止</h2>
            10.1终止的情形：<br>
            10.1.1您有权通过以下任一方式终止本协议：<br>
            10.1.1.1变更事项生效前您停止使用并明示不愿接受变更事项的；<br>
            10.1.1.2您明示不愿继续使用二维火人脸会员服务，且符合二维火人脸会员服务终止条件的。<br>
            10.1.2出现以下情况时，二维火可以本协议第十条的所列的方式通知您终止本协议：<br>
            10.1.2.1您违反本协议约定，二维火依据违约条款终止本协议的；<br>
            10.1.2.2您利用二维火人脸会员服务骗取他人财物、采取不正当手段谋利等行为的；<br>
            10.1.2.3您在使用二维火人脸会员服务有侵犯他人合法权益或其他严重违法违约行为的；<br>
            10.1.2.4其它根据相关法律法规二维火应当终止服务的情况。<br><br>
            10.2协议终止后的处理<br>
            本协议终止后，除法律有明确规定外，二维火无义务向您或您指定的第三方披露您的任何信息。本协议终止后，二维火享有下列权利：<br>
            10.2.1停止收集和使用您的个人信息，但可继续保存您留存于二维火人脸会员服务的其他内容和信息；<br>
            10.2.2对于您过往的违约行为，二维火仍可依据本协议向您追究违约责任。
        </article>
    </div>
</template>
<script>
export default {
	created() {
		document.title = '二维火人脸识别服务协议'
	}
}
</script>
<style lang="scss" scoped>
.prot-wrap {
	width: 100%;
	padding: 30px 20px;
	word-break: break-all;
	font-size: 28px;
    line-height: 1.6;
	article {
		padding-bottom: 40px;
	}
    h2{
        margin: 0;
        font-size: 30px;
        padding: 10px 0;
    }
}
</style>


